## formulae
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Semantic version parser for node (the one npm uses)
brew "semver"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# BDD unit testing framework for dash, bash, ksh, zsh and all POSIX shells
brew "shellspec"
# Autoformat shell script source code
brew "shfmt"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"

## casks
# Software for Logitech devices
cask "logi-options+"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
