## formulae
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Java-based project management
brew "maven"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql-client@8.0"
# Semantic version parser for node (the one npm uses)
brew "semver"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# BDD unit testing framework for dash, bash, ksh, zsh and all POSIX shells
brew "shellspec"
# Autoformat shell script source code
brew "shfmt"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Blazingly fast Zsh syntax highlighter
brew "zsh-patina"

## casks
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Multi-track audio editor and recorder
cask "audacity"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Online diagram software
cask "drawio"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Software for Logitech devices
cask "logi-options+"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Collaboration platform for API development
cask "postman"
# Download manager
cask "progressive-downloader"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
